### 대한민국 체력장 데이터

In [1]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/body/body.csv')
df.head()

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급
0,59.0,M,175.0,70.6,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C
1,40.0,F,161.4,45.8,21.7,62.0,119.0,22.1,16.0,32.0,165.0,B
2,27.0,M,176.6,84.8,19.2,87.0,153.0,45.9,13.2,61.0,216.0,B
3,38.0,M,167.6,76.7,24.7,63.0,132.0,43.6,16.0,45.0,231.0,A
4,21.0,M,165.2,66.2,21.5,83.0,106.0,33.5,10.6,46.0,198.0,C

In [2]:
#Question70 전체데이터의 수축기혈압(최고) - 이완기혈압(최저)의 평균을 구하여라

In [4]:
df['수축기혈압(최고) : mmHg'].max()

5109.0

In [8]:
ans = (df['수축기혈압(최고) : mmHg'] - df['이완기혈압(최저) : mmHg']).mean()
ans

52.19539414750672

In [9]:
#Question71 50~59세의 신장평균을 구하여라

In [12]:
ans = df[(df['측정나이']<60) & (df['측정나이']>=50)]
ans

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급
0,59.0,M,175.0,70.6,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C
15,52.0,F,153.1,52.4,32.6,87.0,154.0,22.6,7.4,9.0,131.0,D
17,53.0,M,181.9,76.5,20.1,78.0,131.0,37.5,18.0,51.0,195.0,C
28,50.0,F,159.9,59.5,25.2,84.0,140.0,28.7,25.8,32.0,170.0,A
31,58.0,F,152.7,49.1,25.1,68.0,124.0,23.0,12.9,0.0,122.0,D
...,...,...,...,...,...,...,...,...,...,...,...,...
13340,59.0,F,161.0,68.2,38.4,71.0,131.0,25.4,11.5,13.0,103.0,D
13343,54.0,F,160.0,60.8,34.5,77.0,128.0,23.9,12.9,14.0,120.0,C
13370,51.0,M,163.6,71.1,22.7,74.0,118.0,36.3,5.9,40.0,182.0,C
13374,55.0,F,149.4,49.9,38.8,65.0,104.0,20.3,19.9,16.0,114.0,C
13376,58.0,F,160.1,64.6,31.3,94.0,154.0,20.5,21.5,20.0,134.0,C

In [13]:
ans=ans['신장 : cm'].mean()
ans

164.07490107405295

In [15]:
def change_age(x):
    if 19 < x < 30:
        return '20대'
    elif 29 < x < 40:
        return '30대'
    elif 39 < x < 50:
        return '< 40대'
    elif 49 < x < 60:
        return '50대'
    elif 59 < x < 70:
        return '60대'

In [35]:
#연령대 만드는 법 알아두자! 함수보다 좋다
df['연령대']=df['측정나이']//10*10
ans = df['연령대'].value_counts()
ans

20.0    5831
30.0    2660
40.0    1801
50.0    1769
60.0    1335
Name: 연령대, dtype: int64

In [ ]:
#Question72 남성 중 A등급과 D등급의 체지방률 평균의 차이(큰 값에서 작은 값의 차)를 구하여라

In [36]:
df.head()

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급,연령대
0,59.0,M,175.0,70.6,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C,50.0
1,40.0,F,161.4,45.8,21.7,62.0,119.0,22.1,16.0,32.0,165.0,B,40.0
2,27.0,M,176.6,84.8,19.2,87.0,153.0,45.9,13.2,61.0,216.0,B,20.0
3,38.0,M,167.6,76.7,24.7,63.0,132.0,43.6,16.0,45.0,231.0,A,30.0
4,21.0,M,165.2,66.2,21.5,83.0,106.0,33.5,10.6,46.0,198.0,C,20.0

In [37]:
ans = df[df['측정회원성별']=='M']
ans

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급,연령대
0,59.0,M,175.0,70.60,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C,50.0
2,27.0,M,176.6,84.80,19.2,87.0,153.0,45.9,13.2,61.0,216.0,B,20.0
3,38.0,M,167.6,76.70,24.7,63.0,132.0,43.6,16.0,45.0,231.0,A,30.0
4,21.0,M,165.2,66.20,21.5,83.0,106.0,33.5,10.6,46.0,198.0,C,20.0
6,35.0,M,173.6,84.08,25.4,97.0,157.0,48.8,26.4,58.0,229.0,B,30.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13391,61.0,M,167.0,65.80,22.2,71.0,130.0,33.7,14.5,37.0,182.0,C,60.0
13392,25.0,M,170.7,64.20,22.4,57.0,121.0,32.5,11.8,48.0,196.0,C,20.0
13393,47.0,M,166.2,77.50,22.8,84.0,133.0,52.4,11.9,45.0,220.0,B,40.0
13394,29.0,M,175.4,74.40,16.1,77.0,124.0,58.4,23.5,48.0,245.0,B,20.0
13395,28.0,M,173.8,78.50,17.3,88.0,119.0,50.1,19.9,57.0,237.0,A,20.0

In [39]:
a = (ans[ans['등급']=='A'])['체지방율 : %'].mean()
a

16.88088084450403

In [40]:
b = (ans[ans['등급']=='D'])['체지방율 : %'].mean()
b

24.812967330641488

In [41]:
print(b-a)

7.932086486137457

In [ ]:
#Question73 여성 중 A등급과 D등급의 체중의 평균의 차이(큰 값에서 작은 값의 차)를 구하여라)

In [46]:
ans = df[df['측정회원성별']=='F']
ans

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급,연령대
1,40.0,F,161.4,45.8,21.7,62.0,119.0,22.1,16.0,32.0,165.0,B,40.0
5,22.0,F,164.6,54.1,27.6,65.0,110.0,28.9,18.8,50.0,158.0,B,20.0
9,34.0,F,157.2,43.9,20.7,71.0,117.0,23.1,24.4,40.0,183.0,B,30.0
14,41.0,F,151.9,57.7,37.7,73.0,113.0,27.0,21.4,37.0,154.0,B,40.0
15,52.0,F,153.1,52.4,32.6,87.0,154.0,22.6,7.4,9.0,131.0,D,50.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13376,58.0,F,160.1,64.6,31.3,94.0,154.0,20.5,21.5,20.0,134.0,C,50.0
13378,32.0,F,169.1,51.5,21.9,70.0,115.0,25.8,3.4,23.0,136.0,D,30.0
13382,24.0,F,175.7,60.2,24.9,67.0,119.0,30.3,15.6,34.0,156.0,B,20.0
13383,21.0,F,167.2,77.9,34.7,83.0,121.0,36.0,21.8,33.0,169.0,B,20.0
13386,43.0,F,160.0,55.1,23.9,66.0,117.0,30.0,16.0,43.0,157.0,B,40.0

In [48]:
a = (ans[ans['등급']=='A'])['체중 : kg'].mean()
a

55.52114555256064

In [47]:
b = (ans[ans['등급']=='D'])['체중 : kg'].mean()
b

60.69735714285715

In [49]:
print(b-a)

5.176211590296511

In [ ]:
#Question74 bmi는 자신의 몸무게(kg)를 키의 제곱(m)으로 나눈값이다. 데이터의 bmi 를 구한 새로운 컬럼을 만들고 남성의 bmi 평균을 구하여라

In [66]:
df['bmi']=df['체중 : kg']/(df['신장 : cm']/100)**2
df

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급,연령대,bmi
0,59.0,M,175.0,70.6,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C,50.0,23.053061
1,40.0,F,161.4,45.8,21.7,62.0,119.0,22.1,16.0,32.0,165.0,B,40.0,17.581601
2,27.0,M,176.6,84.8,19.2,87.0,153.0,45.9,13.2,61.0,216.0,B,20.0,27.190328
3,38.0,M,167.6,76.7,24.7,63.0,132.0,43.6,16.0,45.0,231.0,A,30.0,27.305324
4,21.0,M,165.2,66.2,21.5,83.0,106.0,33.5,10.6,46.0,198.0,C,20.0,24.257046
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
13391,61.0,M,167.0,65.8,22.2,71.0,130.0,33.7,14.5,37.0,182.0,C,60.0,23.593531
13392,25.0,M,170.7,64.2,22.4,57.0,121.0,32.5,11.8,48.0,196.0,C,20.0,22.032713
13393,47.0,M,166.2,77.5,22.8,84.0,133.0,52.4,11.9,45.0,220.0,B,40.0,28.056899
13394,29.0,M,175.4,74.4,16.1,77.0,124.0,58.4,23.5,48.0,245.0,B,20.0,24.183199
13395,28.0,M,173.8,78.5,17.3,88.0,119.0,50.1,19.9,57.0,237.0,A,20.0,25.987836

In [67]:
ans = (df[df['측정회원성별']=='M'])['bmi'].mean()
ans

24.461344098193027

In [ ]:
#Question75 bmi보다 체지방율이 높은 사람들의 체중평균을 구하여라

In [71]:
ans = df[df['체지방율 : %']>df['bmi']]
ans=ans['체중 : kg'].mean()
print(ans)

61.740880639254314

In [ ]:
#Question76 남성과 여성의 악력 평균의 차이를 구하여라

In [77]:
a = df[(df['측정회원성별']=='F')]['악력D : kg'].mean()
a

25.80584511370621

In [76]:
b = df[(df['측정회원성별']=='M')]['악력D : kg'].mean()
b

43.365386964180885

In [78]:
print(b-a)

17.559541850474677

In [ ]:
#Question77 남성과 여성의 교차윗몸일으키기 횟수의 평균의 차이를 구하여라

In [79]:
ans = df.groupby('측정회원성별')['교차윗몸일으키기 : 회'].mean()

In [82]:
ans.M-ans.F

14.243156833157634

### 기온 강수량 데이터

In [83]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/weather/weather2.csv")
df.head()

                  time  이화동강수  이화동기온  수영동강수  수영동기온
0  2020-01-01 00:00:00    0.1   -3.9    0.0    2.5
1  2020-01-01 01:00:00    0.0   -3.1    0.0    3.4
2  2020-01-01 02:00:00    0.0   -1.8    0.0    3.8
3  2020-01-01 03:00:00    0.0   -0.8    0.0    4.6
4  2020-01-01 04:00:00    0.0   -0.1    0.0    5.1

In [ ]:
#Question78 여름철(6월,7월,8월) 이화동이 수영동보다 높은 기온을 가진 시간대는 몇개인가?

In [88]:
df['time']=pd.to_datetime(df['time'])

In [89]:
df.time.dt.month.isin([6,7,8])

0       False
1       False
2       False
3       False
4       False
        ...
8779    False
8780    False
8781    False
8782    False
8783    False
Name: time, Length: 8784, dtype: bool

In [105]:
ans = df[df.time.dt.month.isin([6,7,8])].reset_index(drop=True)

In [111]:
ans

                    time  이화동강수      이화동기온  수영동강수      수영동기온
0    2020-06-01 00:00:00    0.0  21.100000    0.0  24.799999
1    2020-06-01 01:00:00    0.0  22.400000    0.0  23.500000
2    2020-06-01 02:00:00    0.0  23.100000    0.0  23.100000
3    2020-06-01 03:00:00    0.0  23.100000    0.0  25.400000
4    2020-06-01 04:00:00    0.0  23.799999    0.0  24.500000
...                  ...    ...        ...    ...        ...
2203 2020-08-31 19:00:00    0.0  24.299999    0.0  24.100000
2204 2020-08-31 20:00:00    0.0  23.900000    0.0  24.200001
2205 2020-08-31 21:00:00    0.0  24.000000    0.0  24.600000
2206 2020-08-31 22:00:00    0.0  24.600000    0.0  24.900000
2207 2020-08-31 23:00:00    0.0  25.000000    0.0  26.900000

[2208 rows x 5 columns]

In [112]:
ans['이화동기온'] > ans['수영동기온']

0       False
1       False
2       False
3       False
4       False
        ...
2203     True
2204    False
2205    False
2206    False
2207    False
Length: 2208, dtype: bool

In [114]:
a = len(ans.loc[ans['이화동기온'] > ans['수영동기온']])

In [115]:
print(a)

1415

In [ ]:
#Question79 이화동과 수영동의 최대강수량의 시간대를 각각 구하여라

In [126]:
 df.loc[:1]

                 time  이화동강수  이화동기온  수영동강수  수영동기온
0 2020-01-01 00:00:00    0.1   -3.9    0.0    2.5
1 2020-01-01 01:00:00    0.0   -3.1    0.0    3.4

In [128]:
a = df.loc[df['이화동강수']==df['이화동강수'].max()].time.values
b = df.loc[df['수영동강수']==df['수영동강수'].max()].time.values
print(a,b)

['2020-09-30T09:00:00.000000000'] ['2020-07-23T12:00:00.000000000']

In [118]:
a

33.299999

### 서비스 이탈예측 데이터

In [129]:
import pandas as pd
#데이터 로드
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/train.csv")
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,6842,15793491,Cherkasova,714,Germany,Male,26,3,119545.48,2,1,0,65482.94,0
1,8963,15607874,Keane,687,France,Male,38,0,144450.58,1,0,1,137276.83,0
2,7047,15737627,Rivero,589,Germany,Female,20,2,121093.29,2,1,0,3529.72,0
3,7503,15697844,Whitehouse,721,Spain,Female,32,10,0.00,1,1,0,136119.96,1
4,3439,15722404,Carpenter,445,France,Female,30,3,0.00,2,1,1,127939.19,0

In [ ]:
#Question80 남성 이탈(Exited)이 가장 많은 국가(Geography)는 어디이고 이탈 인원은 몇명인가?

In [135]:
df.loc[df['Gender']=='Male'].groupby(['Geography']).sum().Exited.sort_values(ascending=False).head(1)

Geography
Germany    287
Name: Exited, dtype: int64

In [ ]:
#Question81 Balance 값이 중간값 이상을 가지는 고객들의 CreditScore의 표준편차를 소숫점이하 3자리까지 구하여라

In [137]:
ans = df[df['Balance'] >= (df['Balance'].median())]

In [139]:
round(ans['CreditScore'].std(),3)

97.295

### 성인 건강검진 데이터

In [147]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/smoke/train.csv")
df.head()

,성별코드,연령대코드(5세단위),신장(5Cm단위),체중(5Kg단위),허리둘레,시력(좌),시력(우),청력(좌),청력(우),수축기혈압,...,혈색소,요단백,혈청크레아티닌,(혈청지오티)AST,(혈청지오티)ALT,감마지티피,흡연상태,구강검진수검여부,치아우식증유무,치석
0,F,55,145,55,73.0,0.7,0.5,1.0,1.0,129.0,...,12.9,1.0,0.9,172.0,209.0,15.0,0,Y,0.0,Y
1,M,40,180,55,74.0,1.5,1.5,1.0,1.0,102.0,...,15.6,1.0,0.8,30.0,19.0,23.0,1,Y,0.0,Y
2,F,55,150,50,72.0,1.0,0.2,1.0,1.0,116.0,...,14.1,1.0,1.0,31.0,19.0,10.0,0,Y,0.0,N
3,M,40,170,85,89.0,1.0,0.8,1.0,1.0,124.0,...,16.7,1.0,1.0,26.0,38.0,108.0,1,Y,1.0,Y
4,F,40,155,45,62.0,0.5,1.0,1.0,1.0,127.0,...,12.9,1.0,0.7,20.0,11.0,13.0,0,Y,0.0,N

In [ ]:
#Question82 수축기혈압과 이완기 혈압기 수치의 차이를 새로운 컬럼(‘혈압차’) 으로 생성하고, 연령대 코드별 각 그룹 중 ‘혈압차’ 의 분산이 5번째로 큰 연령대 코드를 구하여라

In [151]:
df['혈압차'] = df['수축기혈압'] - df['이완기혈압']
df['혈압차']

0        45.0
1        32.0
2        44.0
3        44.0
4        42.0
         ...
44548    55.0
44549    53.0
44550    39.0
44551    44.0
44552    41.0
Name: 혈압차, Length: 44553, dtype: float64

In [155]:
ans = df.groupby('연령대코드(5세단위)')['혈압차'].var().sort_values()

In [157]:
ans.index[-5]

60

In [ ]:
#Question83 비만도를 나타내는 지표인 WHtR는 허리둘레 / 키로 표현한다. 일반적으로 0.58이상이면 비만으로 분류한다. 데이터중 WHtR 지표상 비만인 인원의 남/여 비율을 구하여라

In [159]:
df['WHtR'] = df['허리둘레']/df['신장(5Cm단위)']
df['WHtR']

0        0.503448
1        0.411111
2        0.480000
3        0.523529
4        0.400000
           ...
44548    0.600000
44549    0.502857
44550    0.546667
44551    0.405882
44552    0.467742
Name: WHtR, Length: 44553, dtype: float64

In [161]:
ans = df[df['WHtR'] >= 0.58]

In [164]:
ans=ans['성별코드'].value_counts()

In [165]:
ans = ans.M/ans.F

In [166]:
ans

1.1693877551020408

### 자동차 보험가입 예측데이터

In [167]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/insurance/train.csv")
df.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,188957,Female,25,1,17.0,1,< 1 Year,No,38785.0,152.0,59,0
1,275631,Male,20,1,22.0,0,< 1 Year,No,2630.0,160.0,113,0
2,329036,Female,40,1,41.0,0,1-2 Year,Yes,33165.0,124.0,188,0
3,227288,Female,28,1,30.0,1,< 1 Year,No,29038.0,152.0,233,0
4,300441,Female,50,1,28.0,0,1-2 Year,Yes,31325.0,124.0,258,0

In [ ]:
#Question84 Vehicle_Age 값이 2년 이상인 사람들만 필터링 하고 그중에서 Annual_Premium 값이 전체 데이터의 중간값 이상인 사람들을 찾고, 그들의 Vintage값의 평균을 구하여라

In [168]:
df['Vehicle_Age'].unique()

array(['< 1 Year', '1-2 Year', '> 2 Years'], dtype=object)

In [169]:
ans = df[df['Vehicle_Age']=='> 2 Years']

In [170]:
df['Annual_Premium'].median()

31663.0

In [171]:
ans = ans[ans['Annual_Premium'] > 31663]

In [172]:
ans = ans['Vintage'].mean()

In [173]:
ans

154.43647182359118

In [ ]:
#Question85 vehicle_age에 따른 각 성별(gender)그룹의 Annual_Premium값의 평균을 구하여 아래 테이블과 동일하게 구현하라

In [181]:
ans = df.groupby(['Gender','Vehicle_Age'],as_index=False)['Annual_Premium'].mean()
#as_index=False 꼭 넣어주어야함

In [182]:
ans.pivot(index='Vehicle_Age',columns='Gender',values='Annual_Premium')

Gender             Female          Male
Vehicle_Age
1-2 Year     30762.245001  30413.088469
< 1 Year     29972.286702  30310.982212
> 2 Years    36108.366374  35303.870627

### 핸드폰 가격 예측데이터

In [183]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/mobile/train.csv")
df.head()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1

In [ ]:
#Question86 price_range 의 각 value를 그룹핑하여 각 그룹의 n_cores 의 빈도가 가장높은 value와 그 빈도수를 구하여라

In [ ]:
# 여기 문제 답 잘 이해되지 않음

In [197]:
ans = df[['price_range','n_cores']].groupby(['price_range','n_cores']).size().sort_values(0).groupby(level=0).tail(1)

In [203]:
df[['price_range','n_cores']].groupby(['price_range','n_cores']).size().sort_values().groupby(level=0)

In [210]:
ans

price_range  n_cores
0            2          69
3            5          70
2            4          73
1            1          76
dtype: int64

In [184]:
df.groupby('price_range')['n_cores'].count()

price_range
0    500
1    500
2    500
3    500
Name: n_cores, dtype: int64

In [ ]:
#Question87 price_range 값이 3인 그룹에서 상관관계가 2번째로 높은 두 컬럼과 그 상관계수를 구하여라

In [211]:
ans = df[df['price_range']==3]

In [215]:
a=ans.corr().unstack().sort_values(ascending=False)

In [220]:
ans2=a.loc[a!=1].reset_index().iloc[1]

In [221]:
ans2

level_0          pc
level_1          fc
0          0.635166
Name: 1, dtype: object

### 비행기 탑승 경험 만족도 데이터

In [222]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/airline/train.csv")
df.head()

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,Inflight wifi service,Departure/Arrival time convenient,Ease of Online booking,...,Inflight entertainment,On-board service,Leg room service,Baggage handling,Checkin service,Inflight service,Cleanliness,Departure Delay in Minutes,Arrival Delay in Minutes,satisfaction
0,55882,Male,Loyal Customer,42,Business travel,Business,473,1,1,3,...,5,5,5,5,3,5,3,3,0.0,satisfied
1,31906,Female,Loyal Customer,31,Business travel,Business,3271,4,4,4,...,3,3,5,5,3,4,3,1,5.0,satisfied
2,85481,Male,Loyal Customer,51,Personal Travel,Eco,214,5,0,5,...,3,4,4,4,4,4,3,2,0.0,satisfied
3,102134,Male,Loyal Customer,44,Business travel,Business,3097,1,1,3,...,4,4,4,4,3,4,5,0,0.0,satisfied
4,31580,Male,Loyal Customer,33,Business travel,Business,3286,1,1,1,...,4,2,5,2,5,1,4,0,0.0,satisfied

In [223]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83123 entries, 0 to 83122
Data columns (total 24 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   id                                 83123 non-null  int64
 1   Gender                             83123 non-null  object
 2   Customer Type                      83123 non-null  object
 3   Age                                83123 non-null  int64
 4   Type of Travel                     83123 non-null  object
 5   Class                              83123 non-null  object
 6   Flight Distance                    83123 non-null  int64
 7   Inflight wifi service              83123 non-null  int64
 8   Departure/Arrival time convenient  83123 non-null  int64
 9   Ease of Online booking             83123 non-null  int64
 10  Gate location                      83123 non-null  int64
 11  Food and drink                     83123 non-null  int64
 12  Online boarding                    83123 non-null  int64
 13  Seat comfort                       83123 non-null  int64
 14  Inflight entertainment             83123 non-null  int64
 15  On-board service                   83123 non-null  int64
 16  Leg room service                   83123 non-null  int64
 17  Baggage handling                   83123 non-null  int64
 18  Checkin service                    83123 non-null  int64
 19  Inflight service                   83123 non-null  int64
 20  Cleanliness                        83123 non-null  int64
 21  Departure Delay in Minutes         83123 non-null  int64
 22  Arrival Delay in Minutes           82867 non-null  float64
 23  satisfaction                       83123 non-null  object
dtypes: float64(1), int64(18), object(5)
memory usage: 15.2+ MB

In [ ]:
#Question88 Arrival Delay in Minutes 컬럼이 결측치인 데이터들 중 ‘neutral or dissatisfied’ 보다 ‘satisfied’의 수가 더 높은 Class는 어디 인가?

In [226]:
ans=df.loc[df['Arrival Delay in Minutes'].isnull()].groupby(['Class','satisfaction'],as_index=False).size().pivot(index='Class',columns='satisfaction')

In [227]:
ans

                                size
satisfaction neutral or dissatisfied satisfied
Class
Business                          36        76
Eco                              100        25
Eco Plus                          15         4

In [230]:
ans2  = ans[ans['size']['neutral or dissatisfied'] < ans['size']['satisfied']]

In [231]:
ans2

                                size
satisfaction neutral or dissatisfied satisfied
Class
Business                          36        76

### 수질 음용성 여부 데이터

In [232]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/waters/train.csv")
df.head()

,ph,Hardness,Solids,Chloramines,Sulfate,Conductivity,Organic_carbon,Trihalomethanes,Turbidity,Potability
0,7.918150,214.186611,23823.492888,7.290878,341.173322,411.424483,19.585002,25.057375,4.028958,0
1,5.422446,205.266080,18542.957451,5.491963,306.702227,382.080129,10.504023,67.493450,2.911751,1
2,7.341547,187.672402,21273.457066,7.784003,NaN,332.084293,16.842334,55.019151,4.025644,0
3,9.056245,197.666301,17403.532167,7.688917,337.460176,414.766631,15.349869,63.696746,3.319354,0
4,5.039374,142.860598,40829.353167,7.271543,NaN,386.803057,16.823773,52.297113,4.957420,0

In [ ]:
#Question89 ph값은 상당히 많은 결측치를 포함한다. 결측치를 제외한 나머지 데이터들 중 사분위값 기준 하위 25%의 값들의 평균값은?

In [233]:
ans = df['ph'].dropna()

In [235]:
ans.describe()`

count    2225.000000
mean        7.059707
std         1.608470
min         0.000000
25%         6.069364
50%         7.025504
75%         8.064653
max        14.000000
Name: ph, dtype: float64

In [257]:
ans = df['ph'].dropna()
ans2 = ans.loc[ans <= ans.quantile(0.25)].mean()

In [258]:
ans2

5.057093462441732

In [254]:
target = df['ph'].dropna()
answer =target.loc[target <= target.quantile(0.25)].mean()
print(answer)

5.057093462441732

### 의료 비용 예측 데이터

In [259]:
import pandas as pd
train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/train.csv")
train.head()

   age     sex     bmi  children smoker     region      charges
0   64  female  39.330         0     no  northeast  14901.51670
1   47  female  27.830         0    yes  southeast  23065.42070
2   52  female  33.300         2     no  southwest  10806.83900
3   33  female  22.135         1     no  northeast   5354.07465
4   30    male  31.400         1     no  southwest   3659.34600

In [ ]:
#Question90 흡연자와 비흡연자 각각 charges의 상위 10% 그룹의 평균의 차이는?

In [268]:
high = train.loc[train['smoker']=='yes'].charges.quantile(0.9)

In [270]:
high2 = train.loc[train['smoker']=='no'].charges.quantile(0.9)

In [271]:
a = train.loc[(train['smoker']=='yes') & (train['charges']>=high)].charges.mean()

In [272]:
b = train.loc[(train['smoker']=='no') & (train['charges']>=high2)].charges.mean()

In [273]:
print(a-b)

29297.954548156158

### 킹카운티 주거지 가격예측문제 데이터

In [274]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/kingcountyprice//train.csv")
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,8961990160,20150413T000000,567500.0,3,2.5,2080,4556,2.0,0,0,...,8,2080,0,1999,0,98074,47.6036,-122.014,1530,5606
1,9455200205,20140604T000000,525000.0,3,2.0,1540,7800,1.0,0,0,...,8,1540,0,2004,0,98125,47.7041,-122.288,1510,7800
2,7853220670,20140918T000000,540000.0,3,2.5,2860,8935,2.0,0,0,...,8,2860,0,2004,0,98065,47.5336,-121.855,2650,6167
3,3298201170,20141110T000000,350000.0,3,1.0,940,7811,1.0,0,0,...,6,940,0,1959,0,98008,47.6195,-122.118,1180,7490
4,7972604355,20140521T000000,218000.0,3,1.0,1020,7874,1.0,0,0,...,7,1020,0,1956,0,98106,47.5175,-122.346,1290,7320

In [ ]:
#Question91 bedrooms 의 빈도가 가장 높은 값을 가지는 데이터들의 price의 상위 10%와 하위 10%값의 차이를 구하여라

In [278]:
 df['bedrooms'].value_counts()

3     7831
4     5487
2     2230
5     1284
6      230
1      164
7       32
0       12
8       10
9        6
10       2
11       1
33       1
Name: bedrooms, dtype: int64

In [280]:
ans = df[df['bedrooms']==3]['price'].quantile(0.9)

In [281]:
ans2 = df[df['bedrooms']==3]['price'].quantile(0.1)

In [282]:
print(ans-ans2)

505500.0

### 대학원 입학가능성 데이터

In [283]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/admission/train.csv")
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,246,328,110,4,4.0,2.5,9.02,1,0.81
1,100,323,113,3,4.0,4.0,8.88,1,0.79
2,79,296,95,2,3.0,2.0,7.54,1,0.44
3,53,334,116,4,4.0,3.0,8.00,1,0.78
4,444,321,114,5,4.5,4.5,9.16,1,0.87

In [ ]:
#Question92 Serial No. 컬럼을 제외하고 ‘Chance of Admit’을 종속변수, 나머지 변수를 독립변수라 할때, 랜덤포레스트를 통해 회귀 예측을 할 떄 변수중요도 값을 출력하라 (시드값에 따라 순서는 달라질수 있음)

In [284]:
# 회귀예측 2유형 할 때 다시 확인

### 레드 와인 퀄리티 예측 데이터

In [285]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/redwine/train.csv")
df.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,5.0,0.38,0.01,1.6,0.048,26.0,60.0,0.99084,3.70,0.75,14.0,6
1,5.0,0.42,0.24,2.0,0.060,19.0,50.0,0.99170,3.72,0.74,14.0,8
2,7.1,0.36,0.30,1.6,0.080,35.0,70.0,0.99693,3.44,0.50,9.4,5
3,7.6,0.29,0.49,2.7,0.092,25.0,60.0,0.99710,3.31,0.61,10.1,6
4,7.7,0.51,0.28,2.1,0.087,23.0,54.0,0.99800,3.42,0.74,9.2,5

In [ ]:
#Question93 quality 값이 3인 그룹과 8인 데이터그룹의 각 컬럼별 독립변수의 표준편차 값의 차이를 구할때 그값이 가장 큰 컬럼명을 구하여라

In [289]:
a=df[df['quality']==3].std()

In [290]:
b=df[df['quality']==8].std()

In [301]:
ans=pd.DataFrame(b-a.sort_values())

In [317]:
ans = (df.loc[df['quality']==8].std() - df.loc[df['quality']==3].std())

In [320]:
ans.sort_values().index[-1]

'total sulfur dioxide'

### 약물분류 데이터

In [321]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/drug/train.csv")
df.head()

   Age Sex      BP Cholesterol  Na_to_K  Drug
0   20   F  NORMAL      NORMAL    9.281     4
1   24   M    HIGH      NORMAL    9.475     1
2   34   M  NORMAL        HIGH   22.456     0
3   17   M  NORMAL      NORMAL   10.832     4
4   72   M     LOW        HIGH   16.310     0

In [322]:
#Question94 남성들의 연령대별 (10살씩 구분 0~9세 10~19세 …) Na_to_K값의 평균값을 구해서 데이터 프레임으로 표현하여라

In [325]:
df['연령대'] = df['Age']//10*10

In [326]:
df.head()

   Age Sex      BP Cholesterol  Na_to_K  Drug  연령대
0   20   F  NORMAL      NORMAL    9.281     4   20
1   24   M    HIGH      NORMAL    9.475     1   20
2   34   M  NORMAL        HIGH   22.456     0   30
3   17   M  NORMAL      NORMAL   10.832     4   10
4   72   M     LOW        HIGH   16.310     0   70

In [329]:
df2=df[df['Sex']=='M']

In [330]:
ans = df2.groupby('연령대')['Na_to_K'].mean().to_frame()

In [331]:
ans

       Na_to_K
연령대
10   13.627000
20   18.260769
30   15.244143
40   13.897273
50   14.811273
60   14.284308
70   11.363857

### 사기회사 분류 데이터

In [332]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/audit/train.csv")
df.head()

,Sector_score,LOCATION_ID,PARA_A,Score_A,Risk_A,PARA_B,Score_B,Risk_B,TOTAL,numbers,...,RiSk_E,History,Prob,Risk_F,Score,Inherent_Risk,CONTROL_RISK,Detection_Risk,Audit_Risk,Risk
0,2.72,14,4.53,0.6,2.718,87.93,0.6,52.758,92.46,5.0,...,0.4,0,0.2,0.0,4.0,108.362,0.4,0.5,21.6724,1
1,3.41,16,12.68,0.6,7.608,41.00,0.6,24.600,53.68,5.5,...,0.4,0,0.2,0.0,4.4,41.936,0.4,0.5,8.3872,1
2,2.72,11,3.11,0.6,1.866,113.97,0.6,68.382,117.08,5.5,...,0.4,0,0.2,0.0,4.4,88.832,0.4,0.5,17.7664,1
3,3.41,8,1.12,0.4,0.448,0.00,0.2,0.000,1.12,5.0,...,0.4,0,0.2,0.0,2.2,1.848,0.4,0.5,0.3696,0
4,55.57,9,1.06,0.4,0.424,0.00,0.2,0.000,1.06,5.0,...,0.4,0,0.2,0.0,2.2,1.824,0.4,0.5,0.3648,0

In [ ]:
#Question95 데이터의 Risk 값에 따른 score_a와 score_b의 평균값을 구하여라

In [334]:
df.groupby('Risk')[['Score_A','Score_B']].mean()

       Score_A   Score_B
Risk
0     0.262234  0.225532
1     0.490164  0.444262

### 센서데이터 동작유형 분류 데이터

In [377]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/muscle/train.csv")
df.head()

,motion_0,motion_1,motion_2,motion_3,motion_4,motion_5,motion_6,motion_7,motion_8,motion_9,...,motion_55,motion_56,motion_57,motion_58,motion_59,motion_60,motion_61,motion_62,motion_63,pose
0,-6.0,8.0,5.0,6.0,-12.0,-27.0,5.0,24.0,-8.0,-5.0,...,-1.0,-3.0,-6.0,-9.0,-7.0,36.0,68.0,3.0,-3.0,1
1,-32.0,-3.0,-4.0,-5.0,-1.0,16.0,0.0,-5.0,42.0,2.0,...,-17.0,-12.0,-1.0,-1.0,0.0,-26.0,-11.0,-4.0,-9.0,1
2,35.0,-2.0,-1.0,1.0,-25.0,-16.0,-3.0,-20.0,10.0,1.0,...,6.0,-65.0,6.0,-10.0,-31.0,-19.0,-3.0,-47.0,-17.0,0
3,-15.0,-6.0,-3.0,-5.0,27.0,37.0,-2.0,-2.0,19.0,5.0,...,2.0,11.0,0.0,-2.0,-4.0,-7.0,15.0,3.0,14.0,1
4,60.0,3.0,0.0,-7.0,-6.0,-10.0,-6.0,7.0,-11.0,-4.0,...,-12.0,17.0,-3.0,1.0,2.0,-2.0,20.0,18.0,10.0,0

In [ ]:
#Question96 pose값에 따른 각 motion컬럼의 중간값의 가장 큰 차이를 보이는 motion컬럼은 어디이며 그값은?

In [380]:
df.groupby('pose').median()

,motion_0,motion_1,motion_2,motion_3,motion_4,motion_5,motion_6,motion_7,motion_8,motion_9,...,motion_54,motion_55,motion_56,motion_57,motion_58,motion_59,motion_60,motion_61,motion_62,motion_63
pose,,,,,,,,,,,,,,,,,,,,,
0,-2.0,-1.0,-1.0,0.0,0.0,-1.0,-3.0,-1.0,-2.0,0.0,...,-5.0,-2.0,-1.0,0.0,-1.0,0.0,-1.0,-1.0,-5.0,-1.0
1,-2.0,-1.0,-1.0,-1.0,0.0,0.0,-1.0,-1.0,-1.0,-1.0,...,-1.0,-1.0,-2.0,-1.0,-1.0,-1.0,1.0,1.0,-1.0,-1.0

In [382]:
ans=df.groupby('pose').median().T

In [383]:
ans

pose         0    1
motion_0  -2.0 -2.0
motion_1  -1.0 -1.0
motion_2  -1.0 -1.0
motion_3   0.0 -1.0
motion_4   0.0  0.0
...        ...  ...
motion_59  0.0 -1.0
motion_60 -1.0  1.0
motion_61 -1.0  1.0
motion_62 -5.0 -1.0
motion_63 -1.0 -1.0

[64 rows x 2 columns]

In [384]:
abs(ans[0]-ans[1]).sort_values()

motion_0     0.0
motion_24    0.0
motion_25    0.0
motion_26    0.0
motion_32    0.0
            ...
motion_30    3.0
motion_38    3.0
motion_46    3.5
motion_54    4.0
motion_62    4.0
Length: 64, dtype: float64

In [385]:
ans.tail(5)

pose         0    1
motion_59  0.0 -1.0
motion_60 -1.0  1.0
motion_61 -1.0  1.0
motion_62 -5.0 -1.0
motion_63 -1.0 -1.0

In [ ]:
#.T 배열 전치!

### 현대 차량 가격 분류문제 데이터

In [336]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/hyundai/train.csv")
df.head()

,model,year,price,transmission,mileage,fuelType,tax(£),mpg,engineSize
0,Tucson,2016,12795,Manual,36263,Diesel,30,61.7,1.7
1,I10,2012,3995,Manual,22089,Petrol,20,61.4,1.2
2,I30,2019,24000,Manual,555,Petrol,145,34.0,2.0
3,Tucson,2017,12995,Manual,32147,Diesel,30,61.7,1.7
4,Tucson,2018,14991,Semi-Auto,32217,Diesel,150,57.6,1.7

In [ ]:
# Question97 정보(row수)가 가장 많은 상위 3차종의 price값의 각 평균값은?

In [338]:
df['model'].value_counts().index[:3]

Index([' Tucson', ' I10', ' I30'], dtype='object')

In [339]:
df['model'].nunique()

16

In [342]:
ans = df[(df['model']==' Tucson')  (df['model']=='  I10') or (df['model']=='  I30')]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [343]:
a = df[df['model']==' Tucson']

In [344]:
b = df[df['model']==' I10']

In [345]:
c = df[df['model']==' I30']

In [346]:
new_df = pd.concat([a,b])
new_df.reset_index(drop=True, inplace=True)

In [347]:
new_df = pd.concat([new_df,c])
new_df.reset_index(drop=True, inplace=True)

In [348]:
new_df.head()

,model,year,price,transmission,mileage,fuelType,tax(£),mpg,engineSize
0,Tucson,2016,12795,Manual,36263,Diesel,30,61.7,1.7
1,Tucson,2017,12995,Manual,32147,Diesel,30,61.7,1.7
2,Tucson,2018,14991,Semi-Auto,32217,Diesel,150,57.6,1.7
3,Tucson,2017,13498,Manual,35003,Diesel,30,61.7,1.7
4,Tucson,2019,15998,Manual,3454,Petrol,145,35.3,1.6

In [349]:
new_df['model'].nunique()

3

In [351]:
ans = new_df.groupby('model')['price'].mean().to_frame()
ans

                price
model
 I10      7646.137891
 I30     11651.821759
 Tucson  15805.441373

In [352]:
# 마님 코드 
# 시계열 데이터처럼 isin 사용해서 품
answer =df.loc[df.model.isin(df.model.value_counts().index[:3])].groupby('model').mean()['price'].to_frame()
display(answer)

                price
model
 I10      7646.137891
 I30     11651.821759
 Tucson  15805.441373

### 당뇨여부판단 데이터

In [353]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/diabetes/train.csv")
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,3,102,74,0,0,29.5,0.121,32,0
1,2,144,58,33,135,31.6,0.422,25,1
2,5,136,82,0,0,0.0,0.640,69,0
3,13,145,82,19,110,22.2,0.245,57,0
4,1,117,60,23,106,33.8,0.466,27,0

In [ ]:
# Question98 Outcome 값에 따른 각 그룹의 각 컬럼의 평균 차이를 구하여라

In [355]:
df['Outcome'].unique()

array([0, 1], dtype=int64)

In [357]:
a = df[df['Outcome']==0]
a=a.mean()

In [358]:
b = df[df['Outcome']==1]
b=b.mean()

In [360]:
print(b-a)

Pregnancies                  1.574159
Glucose                     29.943995
BloodPressure                3.202079
SkinThickness                2.952033
Insulin                     33.398645
BMI                          4.541437
DiabetesPedigreeFunction     0.143646
Age                          5.866939
Outcome                      1.000000
dtype: float64

### 넷플릭스 주식 데이터

In [361]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/nflx/NFLX.csv")
df.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1  2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2  2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3  2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4  2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

In [ ]:
# Question99 매년 5월달의 open가격의 평균값을 데이터 프레임으로 표현하라

In [362]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4874 entries, 0 to 4873
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4874 non-null   object
 1   Open       4874 non-null   float64
 2   High       4874 non-null   float64
 3   Low        4874 non-null   float64
 4   Close      4874 non-null   float64
 5   Adj Close  4874 non-null   float64
 6   Volume     4874 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 266.7+ KB

In [363]:
df['Date']=pd.to_datetime(df['Date'])

In [367]:
df.Date.dt.month.isin([5])

0        True
1        True
2        True
3        True
4        True
        ...
4869    False
4870    False
4871    False
4872    False
4873    False
Name: Date, Length: 4874, dtype: bool

In [368]:
df.loc[df.Date.dt.month.isin([5])]['Open'].mean()

109.54378408128083

In [372]:
# 정답
ans = df.groupby(df['Date'].dt.strftime('%Y-%m')).mean() # 전체 다 구한 다음
ans = ans.loc[ans.index.str.contains('-05')].Open # 매년 5월이 있는 것만

In [373]:
ans

Date
2002-05      1.155833
2003-05      1.641497
2004-05      4.261143
2005-05      1.951905
2006-05      4.163571
2007-05      3.159351
2008-05      4.435034
2009-05      5.790571
2010-05     14.417071
2011-05     34.650272
2012-05     10.523247
2013-05     31.936429
2014-05     51.121292
2015-05     85.057429
2016-05     92.705715
2017-05    158.255455
2018-05    329.779541
2019-05    359.664548
2020-05    433.880499
2021-05    496.923996
Name: Open, dtype: float64